# Цикл for:

lst = [1, 3, 4, 2, 0, 123, 321, 222]

#for ааа in lst
    #print(ааа)

#for letter in 'Это строка. Она тоже последовательность':
    #print(letter, end=';')

# Enumerate - индексация при обходе:

#for i, letter in enumerate('Эта строка. Она тоже последовательность'):
    #print(letter, end=f':{i}')

# Генерируется полуоткрытый интервал - начальный элемент в него входит, конечный - нет:

#for j in range(3, 10, 2):
    #print(j)

# Получитьтолько четные

# for n in lst:
#     if n % 2 == 0:
#         print(n)

# Вывести квадраты ЧЕТНЫХ элементов

for j in range(11)